Revit 2024 API
ForgeTypeId.Empty Method
 Checks if the typeId is an empty string
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public bool Empty()
Visual Basic
Public Function Empty As Boolean
Visual C++
public:
bool Empty()
See Also
ForgeTypeId Class
Autodesk.Revit.DB Namespace